/* код написан под MySql */

CREATE TABLE classmates (
    id INT primary key AUTO_INCREMENT,
    name VARCHAR(30),
    age INT,
    adress VARCHAR(50)
);

insert into classmates (name, age, adress) values
    ('Петя1', '18', 'Москва, ул. Пушкина, д.20'),
    ('Петя2', '20', 'Москва, ул. Пушкина, д.20'),
    ('Петя3', '23', 'Москва, ул. Пушкина, д.20'),
    ('Петя4', '24', 'Москва, ул. Пушкина, д.20'),
    ('Петя5', '28', 'Лыткарино, ул. Пушкина, д.20'),
    ('Петя6', '27', 'Москва, ул. Пушкина, д.20'),
    ('Петя7', '17', 'Москва, ул. Пушкина, д.20'),
    ('Петя8', '58', 'Москва, ул. Пушкина, д.20'),
    ('Петя9', '35', 'Лыткарино, ул. Пушкина, д.20');

select name as Имя_студента from classmates
    where adress like 'Москва%' and age between 18 and 29 ;
